//HPMSRPT     JOB (HAYNIE), 'HPMS VSAM TO SEQ',
//            CLASS=T,NOTIFY=&SYSUID,MSGCLASS=T,REGION=4096K
//TLOG      EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.TLOG,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.TLOG,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//PROPINV   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.PROPINV,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.PROPINV,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//INCIDENT   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.INCIDENT,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.INCIDENT,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//MNOTE   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.MNOTE,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.MNOTE,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//PROJECTS   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.PROJECTS,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.PROJECTS,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
/*
//SORTTLOG    EXEC PGM=SORT
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//SORTIN      DD DSN=HRD.HPMS.DATA.TLOG,DISP=SHR
//SORTOUT     DD DSN=&&TLOGSORT,DISP=(NEW,PASS)
//SYSIN       DD *
  SORT FIELDS=(119,8,ZD,D)
/*
//TLOGRPT     EXEC PGM=TLOGRPT
//STEPLIB     DD DSN=HRD.HPMS.PROD.LOAD,DISP=SHR
//SYSOUT      DD SYSOUT=*
//TLOG        DD DSN=&&TLOGSORT,DISP=SHR
//RPTFILE     DD DSN=HRD.HPMS.REPORTS.TLOG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(25,10))
/*
//SORTPINV    EXEC PGM=SORT
//SYSOUT      DD SYSOUT=*
//SYSPRINT    DD SYSOUT=*
//SORTIN      DD DSN=HRD.HPMS.DATA.PROPINV,DISP=SHR
//SORTOUT     DD DSN=&&PINVSORT,DISP=(NEW,PASS)
//SORTOF01    DD DSN=&&PINVACT,DISP=(NEW,PASS)
//SORTOF02    DD DSN=&&PINVSPN,DISP=(NEW,PASS)
//SORTOF03    DD DSN=&&PINVDES,DISP=(NEW,PASS)
//SYSIN       DD *
  SORT FIELDS=(1,12,ZD,D)
  OUTFIL FILES=01,INCLUDE(38,1,ZD,EQ,0)
  OUTFIL FILES=02,INCLUDE(38,1,ZD,EQ,1)
  OUTFIL FILES=03,INCLUDE(38,1,ZD,EQ,3)
/*
//PINVRPT     EXEC PGM=PINVRPT
//STEPLIB     DD DSN=HRD.HPMS.PROD.LOAD,DISP=SHR
//SYSOUT      DD SYSOUT=*
//PINV        DD DSN=&&PINVSORT,DISP=SHR
//PACT        DD DSN=&&PINVACT,DISP=SHR
//PSPN        DD DSN=&&PINVSPN,DISP=SHR
//PDES        DD DSN=&&PINVDES,DISP=SHR
//RPTALL      DD DSN=HRD.HPMS.REPORTS.PROPINV.ALL(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(25,10))
//RPTACT      DD DSN=HRD.HPMS.REPORTS.PROPINV.ACTIVE(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(25,10))
//RPTSPN      DD DSN=HRD.HPMS.REPORTS.PROPINV.SPENT(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(25,10))
//RPTDES      DD DSN=HRD.HPMS.REPORTS.PROPINV.DESTROY(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(25,10))
