//HPMSD01   JOB (HAYNIE), 'HPMS VSAM TO SEQ',
//          CLASS=T,NOTIFY=&SYSUID,MSGCLASS=T,REGION=4096K
//TLOG      EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.TLOG,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.TLOG,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//PROPINV   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.PROPINV,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.PROPINV,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//INCIDENT   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.INCIDENT,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.INCIDENT,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//MNOTE   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.MNOTE,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.MNOTE,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
//PROJECTS   EXEC PGM=IDCAMS
//SYSOUT    DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUDUMP  DD SYSOUT=*
//SYSABOUT  DD SYSOUT=*
//IN        DD DSN=HRD.HPMS.DATA.PROD.PROJECTS,DISP=SHR
//OUT       DD DSN=HRD.HPMS.DATA.PROJECTS,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN) OUTFILE(OUT) REPLACE
