//LHAYNIEC JOB (HAYNIE),'LANCE HAYNIE',
//         CLASS=T,NOTIFY=&SYSUID,MSGCLASS=T,REGION=4096K
//**********************************************************************
//* CATEGORY.: EXAMPLES
//* GROUP....: CICS JCL
//* AUTHOR...: LANCE HAYNIE <LANCE@HAYNIEMAIL.COM>
//* DATE.....: 2016-06-01
//* PURPOSE..: COMPILE CICS BMS/MAP (SCREEN)
//**********************************************************************
//* MODIFICATIONS
//* 2016-06-01 - LHAYNIE - INITIAL VERSION
//**********************************************************************
//* NOTE: EDIT THE SET STATEMENTS TO MATCH YOUR ENVIRONMENT
//MAPSRC      SET MAPSRC=HPMSB06
//ENV         SET ENV=CICSDEV
//SRCDSN      SET SRCDSN=HRD.HPMS.CICS.MAPSET
//CPYLIB      SET CPYLIB=HRD.HPMS.CICS.COPYLIB
//LOADDSN     SET LOADDSN=HANSOLO.&ENV..CICS.SDFHLOAD
//CICSLOAD    SET CICSLOAD=DFH320.CICS.SDFHPROC
//LIB         JCLLIB ORDER=&CICSLOAD
//COMPILE     EXEC DFHMAPS,
//  MAPLIB=&LOADDSN,
//  DSCTLIB=&CPYLIB,
//  MAPNAME=&MAPSRC
//COPY.SYSUT1 DD DSN=&SRCDSN(&MAPSRC),DISP=SHR
