//LHAYNIED    JOB (ACCT#),'LANCE HAYNIE',
//            CLASS=T,NOTIFY=&SYSUID,MSGCLASS=T,REGION=4096K
//REPRO EXEC PGM=IDCAMS
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSABOUT DD SYSOUT=*
//IN01 DD DSN=HRD.ROCKET.DATA.DEV.GRAININV,DISP=SHR
//OUT01 DD DSN=HRD.ROCKET.DATA.DEV.GRAIN.INV,DISP=OLD
//SYSIN DD *
  REPRO INFILE(IN01) OUTFILE(OUT01) REPLACE
