//LHAYNIED    JOB (ACCT#),'LANCE HAYNIE',
//            CLASS=T,NOTIFY=&SYSUID,MSGCLASS=T,REGION=4096K
//            EXEC PGM=HPMSFOFF
//STEPLIB     DD DSN=HANSOLO.CICSDEV.CICS.SDFHLOAD,DISP=SHR
//            DD DSN=DFH320.CICS.SDFHEXCI,DISP=SHR
//SYSPRINT    DD SYSOUT=*
//SYSMDUMP    DD SYSOUT=*
